app/Controllers/Admin/Auth.php

    public function login()
    {
        // Check if the form was submitted
        if ($this->request->getMethod() === 'post') {
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            $userModel = new UserModel();
            $user = $userModel->where('username', $username)->orWhere('email', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'adminuser'
OR `email` = 'adminuser'
 LIMIT 1