app/Controllers/Admin/DashboardController.php

    public function index()
    {
        // Check if user is logged in and has admin role
        if (!session()->get('logged_in') || session('level') !== 'admin') {
            // Show a "Page Not Found" error
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $HotelModel = new HotelModel();
        $produkModel = new ProdukModel();
        $TransportasiModel = new TransportasiModel();

        $data = [
            'title' => 'Dashboard',
            'wisataCount' => $produkModel->countAllResults(),
            'HotelCount' => $HotelModel->countAllResults(),
            'transportasiCount' => $TransportasiModel->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `transportasi`