app/Models/TransportasiModel.php

SELECT *
FROM `transportasi`
---
    public function getAllTransportasi()
    {
        return $this->findAll();